request-template.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:acsb="http://www.ifopt.org.uk/acsb" xmlns:datex2="http://datex2.eu/schema/1_0/1_0" xmlns:ifopt="http://www.ifopt.org.uk/ifopt" xmlns:siri="http://www.siri.org.uk/siri" xmlns:siriWS="http://new.webservice.namespace" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://192.241.154.128/static/siri/siri.xsd">
    <SOAP-ENV:Header />
    <SOAP-ENV:Body>
        <siriWS:GetStopMonitoringService>
            <Request xsi:type="siri:ServiceRequestStructure">
                <siri:RequestTimestamp>{{ timestamp }}</siri:RequestTimestamp>
                <siri:RequestorRef xsi:type="siri:ParticipantRefStructure">YG102988</siri:RequestorRef>
                <siri:MessageIdentifier xsi:type="siri:MessageQualifierStructure">0100700:1351669188:4684</siri:MessageIdentifier>
                {% for stop in stops %}
                <siri:StopMonitoringRequest version="IL2.6" xsi:type="siri:StopMonitoringRequestStructure">
                    <siri:RequestTimestamp>{{ timestamp }}</siri:RequestTimestamp>
                    <siri:MessageIdentifier xsi:type="siri:MessageQualifierStructure"></siri:MessageIdentifier>
		    <siri:PreviewInterval>PT10M</siri:PreviewInterval>
                        <siri:MonitoringRef xsi:type="siri:MonitoringRefStructure">
                        {{ stop }}
                        </siri:MonitoringRef>
                    <siri:MaximumStopVisits>1000</siri:MaximumStopVisits>
                </siri:StopMonitoringRequest>
                {% endfor %}
            </Request>
        </siriWS:GetStopMonitoringService>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
